{
  "title": "Support & Help",
  "subtitle": "Guides for setup, security, and troubleshooting.",
  "quickLinks": "Quick Links",
  "contactTitle": "Contact Support",
  "contactBody": "Please include your workspace name, bot name or ID, a timestamp, a screenshot, and relevant api/runner logs.",
  "sections": {
    "gettingStarted": {
      "title": "Getting Started",
      "line1": "Create a bot by selecting an exchange and a trading pair, then save the configuration and start the bot.",
      "line2": "Tip: use Config Presets to save a known-good setup and apply it to new bots quickly."
    },
    "exchangeKeys": {
      "title": "Exchange API Keys",
      "line1": "Required permissions: trade only (no withdrawals).",
      "line2": "Keys are protected; viewing or editing requires Re-Auth (OTP).",
      "line3": "Common issues: invalid key, IP whitelist not updated, missing trade permissions."
    },
    "botSettings": {
      "title": "Bot Settings Explained",
      "line1": "Futures Strategy: spread, levels, step, distribution, jitter, skew, max skew.",
      "line2": "Volume Bot: daily target, min/max trade, mode.",
      "line3": "Risk: min balance, max deviation, max open orders, daily loss."
    },
    "priceSupport": {
      "title": "Price Support",
      "line1": "When mid price drops below the floor, Price Support buys until mid is back above the floor.",
      "line2": "It uses a separate budget and stops automatically when the budget is depleted.",
      "line3": "A Telegram notification is sent on depletion, and a manual restart is required."
    },
    "priceFollow": {
      "title": "Price Follow (Master / Slave)",
      "line1": "The master exchange provides the price feed (no bot required on master).",
      "line2": "The slave exchange executes trades based on that master feed.",
      "line3": "Stale master feed and deviation protection prevent unsafe orders."
    },
    "manualTrading": {
      "title": "Manual Trading",
      "line1": "Manual limit and market orders are available if enabled by your admin.",
      "line2": "Re-Auth (OTP) is required for manual trading actions.",
      "line3": "Market orders include a slippage warning and should be used carefully."
    },
    "roles": {
      "title": "Users, Roles & Permissions",
      "line1": "Roles include Superadmin, Admin, Operator, and Viewer.",
      "line2": "Permissions are configurable per workspace role.",
      "line3": "Best practice: use least privilege for day-to-day operations."
    },
    "security": {
      "title": "Security",
      "line1": "Cookie-based sessions are protected with CSRF safeguards.",
      "line2": "Re-Auth (OTP) is required for sensitive actions.",
      "line3": "Optional Email 2FA is available.",
      "line4": "Audit logs help track sensitive changes and actions."
    },
    "troubleshooting": {
      "title": "Troubleshooting",
      "line1": "Bot shows ERROR: check runtime reason, keys, balances, and exchange health.",
      "line2": "No orders: config too strict, price follow deviation, or post-only rejects.",
      "line3": "Runner not updating: check runner status and readiness endpoints."
    }
  }
}
